{
  "education": [
    {
      "awards_achievements": [
        "Ontario Tech University Entry Scholarship for averaging 90% to 95% in top 6 high school courses",
        "Dean's List (2020-2021)"
      ],
      "degree": "Bachelor of Information Technology",
      "department": "Game Development And Entrepreneurship",
      "duration": "2017-2021",
      "school_name": "Ontario Tech University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JoshWessel",
  "highlighted_projects": [
    {
      "description": "Developed a text-based basketball simulation game featuring an assortment of mistake-prone basketball players called Babduls (the theme is based on an inside joke). This is an individual project that I continue to work on periodically. It was initially developed as a means to gain more experience and refresh my object oriented programming skills. The program is written using C++ in Visual Studio and uses object-oriented programming. GitKraken is used for source control.",
      "git_url": "https://github.com/JoshWessel/Babsketball",
      "name": "Babsketball (2021)"
    },
    {
      "description": "Developed a first-person firefighting simulator where the user controls a firefighter and must extinguish all fires in a burning building. This was an individual project developed for a final assignment in a fourth year Immersive Technology course at Ontario Tech University. The objective of the project was to develop a firefighting simulation that could theoretically be used by firefighters to decrease their stress while fighting real fires. The project aimed to accomplish this objective by focusing on the visuals and sound of the simulation. Through smoke and flames, and the roaring sound of fire, an intense virtual environment was created in which users could increase their resistance to such a stressful situation. The simulation is built in the Unity game engine and uses C# scripts. Visual Studio was used as an IDE.",
      "name": "Firefighter Simulator (2020)"
    },
    {
      "description": "Worked in a group of eight developers to develop a hybrid 3rd Person Shooter/Real Time Strategy game over the course of my third year at Ontario Tech University. In this project, I worked as an environment artist whose primary responsibilities included 3D modelling and texturing. The project used the agile framework. We participated in daily scrums and planned weekly/bi-weekly sprints. GitKraken was used for source control.",
      "name": "Gridiron (2019-2020)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a system that collects hardware specifications and resource usage data from Linux hosts and sends it to a PostgreSQL database. The system is built on Linux using SQL and bash scripts. Docker is used to create and manage the container in which the system runs. Crontab automates the collection of usage data from the host device by running the appropriate script every minute while the system is active. Finally, the queried data addresses various questions related to the hardware information and usage data in the PostgreSQL database.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_JoshWessel/tree/master/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Implemented a framework for interacting with a PSQL database using Data Access Objects (DAO's). The project follows the implementation provided by Frank P. Moley III in his Learning JDBC LinkedIn Learning course (https://www.linkedin.com/learning/learning-jdbc?u=107506978). The PSQL database used in this project is populated using data from the LinkedIn Learning course's exercise files. The project employs two DAO's used by an executor class to perform various operations on the database. The project is written in Java using IntelliJ. Testing involved running the code provided from the exercise files, then comparing the results with either the results shown in the videos or the expected results, given changes to the implementation. Maven cleans and packages the project. Docker provides a container in which to store the database.",
        "Grep App: Developed an application that searches all files within a given directory for all lines that match a given pattern, writing all matches to a given output location. The application requires the user to supply three parameters. These parameters include a pattern to search for, the search directory, and the output file to store all matched lines. The application was written in Java, using IntelliJ as the IDE. The testing process involved a series of trial and error tests. IntelliJ's debugger was especially useful in identifying issues related to properly searching the given directory. The application was cleaned and packaged using Maven and deployed using Docker. A Docker image was also built and pushed to Docker Hub."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_JoshWessel/tree/master/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Josh Wessel",
  "others": [
    {
      "bullets": [
        "Dean's List (2020-2021)",
        "Rotary Club of Northumberland Sunrise Scholarship for high academic standing"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Developing video games"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed applications using languages such as bash, SQL, and Java, as well as software such as Google Cloud Platform, IntelliJ, Maven, and Docker to gain experience in data engineering. In this position, I was also able to improve various skills, such as using git and communicating with a small team, and learn new skills such as bash CLI and Java. Used agile framework (daily scrum meetings and bi-weekly sprint retrospective meetings) to complete projects.",
      "duration": "2021-Present",
      "title": "Software Developer"
    },
    {
      "company": "Sustainable Cobourg / Hamilton Township",
      "description": "Summer internship working for Sustainable Cobourg (2018-2019) and the Township of Hamilton (2020). My responsibilities included research, data collection, data entry, and creating charts and graphs. I also worked on survey creation for Hamilton Township. Technologies used include Google Suite, Microsoft Office, and a web-based framework that functioned as a database, in which I performed data entry (in the second and third summers). Almost all of my work was individual, allowing me the opportunity to improve my time management skills. I would be given a list of tasks and then left to myself to complete them, allowing me the opportunity to practice effective time management. The third summer was entirely remote, which allowed me to develop my remote communication skills using communication tools such as email and zoom. I was also able to use my organizational skills while working with a large number of files and folders on a daily basis.",
      "duration": "2018-2020 (Summers)",
      "title": "Environmental Intern"
    }
  ],
  "skills": {
    "competent": [
      "RDBMS/SQL",
      "Docker",
      "PostgreSQL",
      "Git",
      "Visual Studio",
      "C#"
    ],
    "familiar": [
      "R",
      "RStudio",
      "GitKraken",
      "Tableau",
      "Tidyverse"
    ],
    "proficient": [
      "Java",
      "C++",
      "Object Oriented Programming",
      "Agile/Scrum",
      "Linux/Bash"
    ]
  },
  "summary": "I graduated from Ontario Tech University with a Bachelor's Degree in Information Technology, majoring in Game Development and Entrepreneurship. During my time at university, I learned languages such as C++, C#, and R, using IDE's such as Visual Studio and RStudio. I was introduced to concepts such as object oriented programming, user research and algorithms \u0026 data structures. I used source control tools such as Git, GitHub, and GitKraken, and other collaboration tools such as Discord \u0026 Trello. I was also given the opportunity to use the agile framework in the form of daily scrum meetings. For the three summers from 2018-2020, I worked as a summer intern for Sustainable Cobourg (2018, 2019), and the Township of Hamilton (2020). My responsibilities included research, data collection, data entry, and data visualization. These summer positions also provided opportunities for me to develop my organization, communication, and time management skills. I am passionate about collecting and organizing data. As a result, I am interested in pursuing a career in the data industry."
}
